import React from 'react';

const Blog = () => {
    return (
        <div className='md:px-20 py-10'>
            <h1 className='text-2xl'>1.How will you improve the performance of a React Application?</h1>
            <p>অ্যাপ্লিকেশন পারফরম্যান্স অপ্টিমাইজ করা সেই ডেভেলপারদের জন্য চাবিকাঠি যারা ব্যবহারকারীর অভিজ্ঞতাকে ইতিবাচক রাখতে তাদের একটি অ্যাপে রাখতে এবং নিযুক্ত রাখতে সচেতন।

                আকামাই এর গবেষণা অনুসারে, লোড সময়ের দ্বিতীয় বিলম্ব রূপান্তর 7 শতাংশ হ্রাস করতে পারে, যা ডেভেলপারদের জন্য অপ্টিমাইজড পারফরম্যান্স সহ অ্যাপ তৈরি করা অপরিহার্য করে তোলে।

                প্রতিক্রিয়া অ্যাপ্লিকেশনগুলিতে, আমরা ডিফল্টরূপে একটি খুব দ্রুত UI নিশ্চিত করি। যাইহোক, একটি অ্যাপ্লিকেশন বৃদ্ধির সাথে সাথে বিকাশকারীরা কিছু পারফরম্যান্স সমস্যার সম্মুখীন হতে পারে।

                এই নির্দেশিকায়, আমরা প্রাক-অপ্টিমাইজেশন কৌশল সহ একটি প্রতিক্রিয়া অ্যাপ্লিকেশনের কর্মক্ষমতা অপ্টিমাইজ করার পাঁচটি গুরুত্বপূর্ণ উপায় নিয়ে আলোচনা করব। এর মধ্যে রয়েছে:</p>

            <p>1.যেখানে প্রয়োজন সেখানে উপাদানের অবস্থা স্থানীয় রাখা
                অপ্রয়োজনীয় রি-রেন্ডার প্রতিরোধ করার জন্য প্রতিক্রিয়া উপাদানগুলি স্মরণ করা</p>
            <p>2.গতিশীল আমদানি () ব্যবহার করে প্রতিক্রিয়াতে কোড-বিভাজন
                প্রতিক্রিয়ায় উইন্ডো করা বা তালিকা ভার্চুয়ালাইজেশন
                প্রতিক্রিয়ায় অলস লোড করা ছবি</p>
            <h1 className='text-2xl mt-10'>2.What are the different ways to manage a state in a React application?</h1>
            <p>আধুনিক প্রতিক্রিয়ায়, আমরা কার্যকরী উপাদান দিয়ে আমাদের অ্যাপ্লিকেশন তৈরি করি। উপাদানগুলি হল জাভাস্ক্রিপ্ট ফাংশন, কোডের স্বাধীন এবং পুনরায় ব্যবহারযোগ্য বিট।

                উপাদানগুলির সাথে অ্যাপ্লিকেশনটি তৈরি করার উদ্দেশ্য হল একটি মডুলার আর্কিটেকচার, উদ্বেগের একটি স্পষ্ট বিচ্ছেদ সহ। এটি কোড বোঝা সহজ, বজায় রাখা সহজ এবং সম্ভব হলে পুনরায় ব্যবহার করা সহজ করে তোলে।

                রাষ্ট্র একটি বস্তু যা একটি নির্দিষ্ট উপাদান সম্পর্কে তথ্য ধারণ করে। প্লেইন জাভাস্ক্রিপ্ট ফাংশন তথ্য সংরক্ষণ করার ক্ষমতা নেই. তাদের মধ্যে থাকা কোডটি এক্সিকিউট হয় এবং এক্সিকিউশন শেষ হয়ে গেলে "অদৃশ্য" হয়ে যায়।

                কিন্তু রাষ্ট্রকে ধন্যবাদ, প্রতিক্রিয়া কার্যকরী উপাদানগুলি সম্পাদনের পরেও তথ্য সংরক্ষণ করতে পারে। যখন আমাদের কিছু সঞ্চয় বা "মনে রাখা" বা পরিবেশের উপর নির্ভর করে একটি ভিন্ন উপায়ে কাজ করার জন্য একটি উপাদানের প্রয়োজন হয়, তখন এটিকে এইভাবে কাজ করার জন্য রাষ্ট্রের প্রয়োজন হয়।

                এটি উল্লেখ করা গুরুত্বপূর্ণ যে একটি প্রতিক্রিয়া অ্যাপের সমস্ত উপাদানের অবস্থা থাকতে হবে না। সেখানেও স্টেটলেস কম্পোনেন্ট রয়েছে যা কোনো তথ্য সঞ্চয় করার প্রয়োজন ছাড়াই এর বিষয়বস্তু রেন্ডার করে, এবং এটি ঠিক আছে।

                উল্লেখ করা আরেকটি গুরুত্বপূর্ণ বিষয় হল যে রাজ্যের পরিবর্তন হল দুটি জিনিসের মধ্যে একটি যা একটি প্রতিক্রিয়া উপাদানকে পুনরায় রেন্ডার করে (অন্যটি হল প্রপসের পরিবর্তন)। এইভাবে, রাষ্ট্র উপাদান সম্পর্কে তথ্য সংরক্ষণ করে এবং এর আচরণ নিয়ন্ত্রণ করে।</p>
            <h1 className='text-2xl mt-10'>3.How does prototypical inheritance work?</h1>
            <p>প্রোটোটাইপ্যাল ​​ইনহেরিট্যান্স হল জাভাস্ক্রিপ্টের একটি বৈশিষ্ট্য যা বস্তুতে পদ্ধতি এবং বৈশিষ্ট্য যোগ করতে ব্যবহৃত হয়। এটি এমন একটি পদ্ধতি যার মাধ্যমে একটি বস্তু অন্য বস্তুর বৈশিষ্ট্য এবং পদ্ধতির উত্তরাধিকারী হতে পারে। ঐতিহ্যগতভাবে, একটি বস্তুর প্রোটোটাইপ পেতে এবং সেট করার জন্য, আমরা অবজেক্ট ব্যবহার করি। getPrototypeOf এবং অবজেক্ট।
            </p>
            <h1 className='text-2xl mt-10'>4. You have an array of products. Each product has a name, price, description, etc. How will you implement a search to find products by name?</h1>
            <p>
                আপনি যখন পণ্যের টেবিল ফিল্টার করছেন তখন মূলত আমাকে একটি 'সব ছাড়া' বিকল্প করতে হবে। আমার দুটি অ্যারে আছে: অনন্য পণ্য এবং নির্বাচিত ফিল্টার। uniqueProducts-এ পণ্যের বস্তু থাকে যা একটি টেবিলে প্রদর্শিত হবে। নির্বাচিত ফিল্টারগুলিতে পূর্ব-নির্বাচিত ফিল্টারগুলির বস্তু রয়েছে।</p>
            <h1 className='text-2xl mt-10'>5. What is a unit test? Why should write unit tests?
</h1>
            <p>
                UNIT TESTING হল এক ধরনের সফটওয়্যার টেস্টিং যেখানে একটি সফটওয়্যারের পৃথক ইউনিট বা উপাদান পরীক্ষা করা হয়। উদ্দেশ্য হল সফ্টওয়্যার কোডের প্রতিটি ইউনিট প্রত্যাশিত হিসাবে কাজ করে তা যাচাই করা। ইউনিট টেস্টিং ডেভেলপারদের দ্বারা একটি অ্যাপ্লিকেশনের বিকাশের সময় (কোডিং পর্ব) করা হয়। ইউনিট পরীক্ষা কোডের একটি বিভাগকে বিচ্ছিন্ন করে এবং এর সঠিকতা যাচাই করে। একটি ইউনিট একটি পৃথক ফাংশন, পদ্ধতি, পদ্ধতি, মডিউল বা বস্তু হতে পারে।

                SDLC, STLC, V মডেলে, ইউনিট টেস্টিং হল ইন্টিগ্রেশন টেস্টিংয়ের আগে করা প্রথম স্তরের পরীক্ষা। ইউনিট টেস্টিং হল একটি হোয়াইটবক্স টেস্টিং কৌশল যা সাধারণত ডেভেলপার দ্বারা সঞ্চালিত হয়। যদিও, একটি ব্যবহারিক জগতে সময়ের সংকট বা পরীক্ষায় ডেভেলপারদের অনিচ্ছার কারণে, QA ইঞ্জিনিয়াররাও ইউনিট টেস্টিং করে থাকে।</p>
        </div>
    );
};

export default Blog;